---
kind: method
id: M:Autodesk.Revit.DB.BasicFileInfo.GetDocumentVersion
source: html/117de15c-6642-4216-cd85-8c31eb42cbca.htm
---
# Autodesk.Revit.DB.BasicFileInfo.GetDocumentVersion Method

Gets the DocumentVersion for the file.

## Syntax (C#)
```csharp
public DocumentVersion GetDocumentVersion()
```

## Returns
The DocumentVersion for the file.